src/doc/myQuoteRequest-1.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns7:calcQuoteRequest xmlns:ns7="http://toi.ru/esb/model/serviceMessagesExt"
                              xmlns:ns6="http://toi.ru/model/gw/quote" xmlns:ns5="http://toi.ru/esb/model/gw/policy"
                              xmlns:ns4="http://toi.ru/model/gw/client" xmlns:ns3="http://toi.ru/model/productinfo"
                              xmlns:ns2="http://toi.ru/model/productinfo/servicemessage">
            <ns7:Header>
                <user>telegram</user>
                <password>qIQqu873KE</password>
            </ns7:Header>
            <ns7:ProductName>PartnerTravelV2Box</ns7:ProductName>
            <ns7:ProductOptions>
                <ns3:Option>
                    <ns3:Code>QuoteRequest</ns3:Code>
                    <ns3:ValueInfo>
                        <ns3:Code>AssistanceLevel</ns3:Code>
                        <ns3:Value>Basic</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>Area</ns3:Code>
                        <ns3:Value>asia</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>QuantityChildren</ns3:Code>
                        <ns3:Value>0</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>QuantityAdults</ns3:Code>
                        <ns3:Value>1</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>QuantitySeniors</ns3:Code>
                        <ns3:Value>0</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>Currency</ns3:Code>
                        <ns3:Value>eur</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:Option>
                        <ns3:Code>Coverages</ns3:Code>
                        <ns3:Option>
                            <ns3:Code>TravelMedicine</ns3:Code>
                            <ns3:ValueInfo>
                                <ns3:Code>TravelMedicineLimit</ns3:Code>
                                <ns3:Value>30000</ns3:Value>
                            </ns3:ValueInfo>
                        </ns3:Option>
                    </ns3:Option>

                    <ns3:Option>
                        <ns3:Code>LeisureType</ns3:Code>
                        <ns3:Option>
                            <ns3:Code>ActiveLeisure</ns3:Code>
                            <ns3:ValueInfo>
                                <ns3:Code>IsExtremeSport</ns3:Code>       <!-- IsProfessionalSport  IsExtremeSport isActiveLeasure  -->
                                <ns3:Value>true</ns3:Value>
                            </ns3:ValueInfo>
                        </ns3:Option>
                    </ns3:Option>

                    <ns3:Option>
                        <ns3:Code>TripDuration</ns3:Code>
                        <ns3:Option>
                            <ns3:Code>SingleTrip</ns3:Code>
                            <ns3:ValueInfo>
                                <ns3:Code>TripStartDate</ns3:Code>
                                <ns3:Value>2016-04-04T00:00:00+03:00</ns3:Value>
                            </ns3:ValueInfo>
                            <ns3:ValueInfo>
                                <ns3:Code>TripEndDate</ns3:Code>
                                <ns3:Value>2016-05-05T00:00:00+03:00</ns3:Value>
                            </ns3:ValueInfo>
                        </ns3:Option>
                    </ns3:Option>
                </ns3:Option>
            </ns7:ProductOptions>
        </ns7:calcQuoteRequest>
    </S:Body>
</S:Envelope>