src/doc/createPolicy-2.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns7:createPolicyRequest xmlns:ns7="http://toi.ru/esb/model/serviceMessagesExt"
                                 xmlns:ns3="http://toi.ru/model/productinfo"
                                 xmlns:ser="http://toi.ru/esb/model/serviceMessagesExt"
                                 xmlns:cli="http://toi.ru/model/gw/client">
            <ns7:Header>
                <user>telegram</user>
                <password>qIQqu873KE</password>
            </ns7:Header>
            <ns7:ProductName>PartnerTravelV2Box</ns7:ProductName>
            <ns7:ProductOptions>
            <ns3:Option>
                    <ns3:Code>QuoteRequest</ns3:Code>
                    <ns3:ValueInfo>
                        <ns3:Code>AssistanceLevel</ns3:Code>
                        <ns3:Value>Basic</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>Area</ns3:Code>
                        <ns3:Value>asia</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>QuantityChildren</ns3:Code>
                        <ns3:Value>0</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>QuantityAdults</ns3:Code>
                        <ns3:Value>1</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>QuantitySeniors</ns3:Code>
                        <ns3:Value>0</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>Currency</ns3:Code>
                        <ns3:Value>eur</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:Option>
                        <ns3:Code>Coverages</ns3:Code>
                        <ns3:Option>
                            <ns3:Code>TravelMedicine</ns3:Code>
                            <ns3:ValueInfo>
                                <ns3:Code>TravelMedicineLimit</ns3:Code>
                                <ns3:Value>30000</ns3:Value>
                            </ns3:ValueInfo>
                        </ns3:Option>
                    </ns3:Option>
                    <ns3:Option>
                        <ns3:Code>LeisureType</ns3:Code>
                        <ns3:Option>
                            <ns3:Code>ActiveLeisure</ns3:Code>
                            <ns3:ValueInfo>
                                <ns3:Code>IsExtremeSport
                                </ns3:Code>       <!-- IsProfessionalSport  IsExtremeSport isActiveLeasure  -->
                                <ns3:Value>true</ns3:Value>
                            </ns3:ValueInfo>
                        </ns3:Option>
                    </ns3:Option>
                    <ns3:Option>
                            <ns3:Code>TripDuration</ns3:Code>
                            <ns3:Option>
                                <ns3:Code>SingleTrip</ns3:Code>
                                <ns3:ValueInfo>
                                    <ns3:Code>TripStartDate</ns3:Code>
                                    <ns3:Value>2016-04-04T00:00:00+03:00</ns3:Value>
                                </ns3:ValueInfo>
                                <ns3:ValueInfo>
                                    <ns3:Code>TripEndDate</ns3:Code>
                                    <ns3:Value>2016-05-05T00:00:00+03:00</ns3:Value>
                                </ns3:ValueInfo>
                            </ns3:Option>
                        </ns3:Option>
                    </ns3:Option>
            </ns7:ProductOptions>


            <ser:ClientInfo>
                <cli:AccountRole>primaryinsured</cli:AccountRole>
                <cli:AccountType>Personal</cli:AccountType>
                <cli:LastName>Маятников</cli:LastName>
                <cli:LastNameEng>MAYATNIKOV</cli:LastNameEng>
                <cli:FirstName>Виталий</cli:FirstName>
                <cli:FirstNameEng>VITALY</cli:FirstNameEng>
                <cli:MiddleName>Николаевич</cli:MiddleName>
                <cli:Birthdate>1955-12-01</cli:Birthdate>
                <cli:Email>mayatnikov@gmail.com</cli:Email>
                <cli:MobilePhone>79165894332</cli:MobilePhone>
                <cli:Gender>male</cli:Gender>
                <cli:TypePrimaryPhone>MOBILE_MAIN</cli:TypePrimaryPhone>
                <cli:Document>
                    <cli:DocumentType>EXT_PASSPORT_RUS</cli:DocumentType>
                    <cli:Series>12</cli:Series>
                    <cli:Number>3456789</cli:Number>
                    <cli:IsActive>true</cli:IsActive>
                </cli:Document>
            </ser:ClientInfo>
            <ser:DeliveryMethod>Email</ser:DeliveryMethod>
            <ser:PaymentMethod>NONE</ser:PaymentMethod>
        </ns7:createPolicyRequest>
    </S:Body>
</S:Envelope>