src/doc/createPolicy-temp.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:createPolicyRequest xmlns:ns2="http://toi.ru/esb/model/serviceMessagesExt"
                                 xmlns:ns3="http://toi.ru/model/productinfo" xmlns:ns4="http://toi.ru/model/gw/client">
            <ns2:Header>
                <integrationID>tg-1458072600078-8</integrationID>
                <user>telegram</user>
                <password>qIQqu873KE</password>
            </ns2:Header>
            <ns2:ProductName>PartnerTravelV2Box</ns2:ProductName>
            <ns2:ProductOptions>
                <ns3:Option>
                    <ns3:Code>QuoteRequest</ns3:Code>
                    <ns3:ValueInfo>
                        <ns3:Code>AssistanceLevel</ns3:Code>
                        <ns3:Value>Basic</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>Area</ns3:Code>
                        <ns3:Value>asia</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>QuantityChildren</ns3:Code>
                        <ns3:Value>0</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>QuantityAdults</ns3:Code>
                        <ns3:Value>1</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>QuantitySeniors</ns3:Code>
                        <ns3:Value>0</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:ValueInfo>
                        <ns3:Code>Currency</ns3:Code>
                        <ns3:Value>eur</ns3:Value>
                    </ns3:ValueInfo>
                    <ns3:Option>
                        <ns3:Code>Coverages</ns3:Code>
                        <ns3:Option>
                            <ns3:Code>TravelMedicine</ns3:Code>
                            <ns3:ValueInfo>
                                <ns3:Code>TravelMedicineLimit</ns3:Code>
                                <ns3:Value>30000</ns3:Value>
                            </ns3:ValueInfo>
                        </ns3:Option>
                        <ns3:Option>
                            <ns3:Code>Luggage</ns3:Code>
                        </ns3:Option>
                        <ns3:Option>
                            <ns3:Code>TripOptions</ns3:Code>
                        </ns3:Option>
                    </ns3:Option>
                    <ns3:Option>
                        <ns3:Code>LeisureType</ns3:Code>
                        <ns3:Option>
                            <ns3:Code>ActiveLeisure</ns3:Code>
                            <ns3:ValueInfo>
                                <ns3:Code>isActiveLeasure</ns3:Code>
                                <ns3:Value>true</ns3:Value>
                            </ns3:ValueInfo>
                        </ns3:Option>
                    </ns3:Option>
                    <ns3:Option>
                        <ns3:Code>TripDuration</ns3:Code>
                        <ns3:Option>
                            <ns3:Code>SingleTrip</ns3:Code>
                            <ns3:ValueInfo>
                                <ns3:Code>TripStartDate</ns3:Code>
                                <ns3:Value>2016-05-12T00:00:00+03:00</ns3:Value>
                            </ns3:ValueInfo>
                            <ns3:ValueInfo>
                                <ns3:Code>TripEndDate</ns3:Code>
                                <ns3:Value>2016-05-22T00:00:00+03:00</ns3:Value>
                            </ns3:ValueInfo>
                        </ns3:Option>
                    </ns3:Option>
                </ns3:Option>
            </ns2:ProductOptions>
            <ns2:DeliveryMethod>Email</ns2:DeliveryMethod>
            <ns2:PaymentMethod>NONE</ns2:PaymentMethod>
        </ns2:createPolicyRequest>
    </S:Body>
</S:Envelope>

